Model:
KerasTensor(type_spec=TensorSpec(shape=(None, 1), dtype=tf.float32, name=None), name='dense_1/Tanh:0', description="created by layer 'dense_1'")
Model Summary: 
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 60, 256)           768       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 60, 256)           0         
_________________________________________________________________
lstm (LSTM)                  (None, 60, 256)           525312    
_________________________________________________________________
dropout (Dropout)            (None, 60, 256)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 128)               197120    
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 723,329
Trainable params: 723,329
Non-trainable params: 0
_________________________________________________________________
mse: 0.008844046853482723