Model:
KerasTensor(type_spec=TensorSpec(shape=(None, 1), dtype=tf.float32, name=None), name='dense_2/Sigmoid:0', description="created by layer 'dense_2'")
Model Summary: 
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 10, 256)           2048      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 10, 256)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 10, 256)           65792     
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 10, 256)           0         
_________________________________________________________________
gru (GRU)                    (None, 128)               148224    
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 216,193
Trainable params: 216,193
Non-trainable params: 0
_________________________________________________________________
mse: 0.012641413137316704