Model:
KerasTensor(type_spec=TensorSpec(shape=(None, 1), dtype=tf.float32, name=None), name='dense_2/Sigmoid:0', description="created by layer 'dense_2'")
Model Summary: 
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 15, 256)           1536      
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 15, 256)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 15, 256)           65792     
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 15, 256)           0         
_________________________________________________________________
lstm (LSTM)                  (None, 128)               197120    
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 264,577
Trainable params: 264,577
Non-trainable params: 0
_________________________________________________________________
mse: 0.0008593842503614724